libhal/SJSU-Dev2/library/L1_Peripheral/stm32f10x/test/system_controller_test.cpp
#include <array>
#include <cstdint>
#include <numeric>
#include <thread>

#include "L0_Platform/stm32f10x/stm32f10x.h"
#include "L1_Peripheral/stm32f10x/system_controller.hpp"
#include "L4_Testing/testing_frameworks.hpp"
#include "utility/units.hpp"

namespace sjsu::stm32f10x
{
EMIT_ALL_METHODS(SystemController);

TEST_CASE("Testing stm32f10x SystemController", "[stm32f10x-systemcontroller]")
{
  std::array<const SystemController::PeripheralID *, 10> id = {
    // AHB
    &stm32f10x::SystemController::Peripherals::kFlitf,
    &stm32f10x::SystemController::Peripherals::kCrc,
    &stm32f10x::SystemController::Peripherals::kFsmc,
    // AHB1
    &stm32f10x::SystemController::Peripherals::kTimer14,
    &stm32f10x::SystemController::Peripherals::kWindowWatchdog,
    &stm32f10x::SystemController::Peripherals::kSpi2,
    // AHB2
    &stm32f10x::SystemController::Peripherals::kGpioG,
    &stm32f10x::SystemController::Peripherals::kAdc2,
    &stm32f10x::SystemController::Peripherals::kTimer1,
    &stm32f10x::SystemController::Peripherals::kAdc3,
  };

  std::array<volatile uint32_t, 3> local_enables;
  std::fill(local_enables.begin(), local_enables.end(), 0);

  FLASH_TypeDef local_flash;
  testing::ClearStructure(&local_flash);

  RCC_TypeDef local_rcc;
  testing::ClearStructure(&local_rcc);

  stm32f10x::SystemController::enable[0]     = &local_enables[0];
  stm32f10x::SystemController::enable[1]     = &local_enables[1];
  stm32f10x::SystemController::enable[2]     = &local_enables[2];
  stm32f10x::SystemController::clock_control = &local_rcc;
  stm32f10x::SystemController::flash         = &local_flash;

  SystemController::ClockConfiguration config;

  SystemController test_subject(config);

  auto system_clock_becomes_ready = [&local_rcc, &config]() {
    // Delay by 10ms to give enough time for other simulated triggers to
    // operate before this cancels.
    std::this_thread::sleep_for(10ms);
    local_rcc.CFGR = bit::Insert(
        local_rcc.CFGR, Value(config.system_clock),
        SystemController::ClockConfigurationRegisters::kSystemClockStatus);
  };

  auto pll_lock = [&local_rcc]() {
    std::this_thread::sleep_for(1ms);
    local_rcc.CR = bit::Set(local_rcc.CR,
                            SystemController::ClockControlRegisters::kPllReady);
  };

  auto high_oscillator_ready = [&local_rcc]() {
    std::this_thread::sleep_for(1ms);

    local_rcc.CR =
        bit::Set(local_rcc.CR,
                 SystemController::ClockControlRegisters::kExternalOscReady);
  };

  auto low_oscillator_ready = [&local_rcc]() {
    std::this_thread::sleep_for(1ms);

    local_rcc.BDCR = bit::Set(
        local_rcc.BDCR, SystemController::RtcRegisters::kLowSpeedOscReady);
  };

  SECTION("PowerUpPeripheral()")
  {
    for (size_t i = 0; i < id.size(); i++)
    {
      INFO("Failed on index: " << i);

      // Exercise
      test_subject.PowerUpPeripheral(*id[i]);

      // Verify
      auto enable_word = local_enables[id[i]->device_id / 32];
      CHECK(bit::Read(enable_word, id[i]->device_id % 32));
    }
  }

  SECTION("PowerDownPeripheral()")
  {
    // Setup
    constexpr auto kAllOnes = std::numeric_limits<uint32_t>::max();
    // Setup: Set every bit in the enables to 1 indicating that the all
    // peripherals are enabled. The PowerDownPeripheral() should clear these
    // bits to 1.
    std::fill(local_enables.begin(), local_enables.end(), kAllOnes);

    for (size_t i = 0; i < id.size(); i++)
    {
      INFO("Failed on index: " << i);

      // Exercise
      test_subject.PowerDownPeripheral(*id[i]);

      // Verify
      auto enable_word = local_enables[id[i]->device_id / 32];
      CHECK(!bit::Read(enable_word, id[i]->device_id % 32));
    }
  }

  SECTION("IsPeripheralPoweredUp()")
  {
    // Setup: Map of expected powered on and off peripherals
    std::array<bool, id.size()> is_set = {
      true,   // [0]
      true,   // [1]
      false,  // [2]
      true,   // [3]
      true,   // [4]
      true,   // [5]
      false,  // [6]
      true,   // [7]
      false,  // [8]
      true,   // [9]
    };

    for (uint32_t i = 0; i < is_set.size(); i++)
    {
      auto & enable_word = local_enables[id[i]->device_id / 32];
      enable_word =
          bit::Insert(enable_word, is_set[i], id[i]->device_id % 32, 1);
    }

    for (size_t i = 0; i < id.size(); i++)
    {
      INFO("Failed on index: " << i);
      // Exercise + Verify
      CHECK(is_set[i] == test_subject.IsPeripheralPoweredUp(*id[i]));
    }
  }

  SECTION("GetClockConfiguration()")
  {
    REQUIRE(&config == test_subject.GetClockConfiguration());
  }

  SECTION("Initialize() + GetClockRate()")
  {
    // Setup
    std::thread simulated_system_clock_ready(system_clock_becomes_ready);

    SECTION("Default Initialize")
    {
      // Exercise
      test_subject.Initialize();
    }

    SECTION("Enable high speed external oscillator")
    {
      // Setup
      std::thread simulate_high_oscillator_ready(high_oscillator_ready);
      config.high_speed_external = 8_MHz;

      // Exercise
      test_subject.Initialize();
      simulate_high_oscillator_ready.join();

      // Verify
      CHECK(bit::Read(
          local_rcc.CR,
          SystemController::ClockControlRegisters::kExternalOscEnable));
    }

    SECTION("Enable low speed external oscillator")
    {
      // Setup
      std::thread simulate_high_oscillator_ready(low_oscillator_ready);
      config.low_speed_external = 8_MHz;

      // Exercise
      test_subject.Initialize();
      simulate_high_oscillator_ready.join();

      // Verify
      CHECK(bit::Read(local_rcc.BDCR,
                      SystemController::RtcRegisters::kLowSpeedOscEnable));
    }

    SECTION("PLL External Oscillator Configuration")
    {
      SECTION("Using HSE /2")
      {
        // Setup
        config.pll.source =
            SystemController::PllSource::kHighSpeedExternalDividedBy2;

        // Exercise
        test_subject.Initialize();

        // Verify
        CHECK(bit::Read(
            local_rcc.CFGR,
            SystemController::ClockConfigurationRegisters::kHsePreDivider));
      }

      SECTION("Using HSE /1")
      {
        SECTION("Using Internal")
        {
          // Setup
          config.pll.source = SystemController::PllSource::kHighSpeedInternal;
        }

        SECTION("Using External")
        {
          // Setup
          config.pll.source = SystemController::PllSource::kHighSpeedExternal;
        }

