libhal/SJSU-Dev2/library/L1_Peripheral/stm32f10x/test/system_controller_test.cpp
        // Exercise
        test_subject.Initialize();

        // Verify
        CHECK(!bit::Read(
            local_rcc.CFGR,
            SystemController::ClockConfigurationRegisters::kHsePreDivider));
      }
    }

    SECTION("PLL Configuration Enable")
    {
      // Setup
      std::thread simulate_pll_locks(pll_lock);

      // Exercise
      test_subject.Initialize();
      simulate_pll_locks.join();

      // Verify
      CHECK(
          Value(config.pll.multiply) ==
          bit::Extract(local_rcc.CFGR,
                       SystemController::ClockConfigurationRegisters::kPllMul));

      CHECK(Value(config.pll.multiply) ==
            bit::Read(local_rcc.CR,
                      SystemController::ClockControlRegisters::kPllEnable));
    }

    SECTION("Flash Wait State Configuration")
    {
      // Setup
      std::thread simulate_pll_locks(pll_lock);
      std::thread simulate_high_oscillator_ready(high_oscillator_ready);
      uint32_t flash_code = 0b000;

      // Setup: Make sure we are using the PLL source
      config.system_clock = SystemController::SystemClockSelect::kPll;

      SECTION("Pll speed = 16 MHz")
      {
        // Setup
        // Setup: Internal is divided by 2 to get 4 MHz
        config.pll.source   = SystemController::PllSource::kHighSpeedInternal;
        config.pll.enable   = true;
        config.pll.multiply = SystemController::PllMultiply::kMultiplyBy4;
        config.system_clock = SystemController::SystemClockSelect::kPll;
        flash_code          = 0b000;
      }

      SECTION("Pll speed = 32 MHz")
      {
        // Setup
        // Setup: Internal is divided by 2 to get 4 MHz
        config.pll.source   = SystemController::PllSource::kHighSpeedInternal;
        config.pll.enable   = true;
        config.pll.multiply = SystemController::PllMultiply::kMultiplyBy8;
        config.system_clock = SystemController::SystemClockSelect::kPll;
        flash_code          = 0b001;
      }

      SECTION("Pll speed = 64 MHz")
      {
        // Setup
        // Setup: Internal is divided by 2 to get 4 MHz
        config.pll.source   = SystemController::PllSource::kHighSpeedInternal;
        config.pll.enable   = true;
        config.pll.multiply = SystemController::PllMultiply::kMultiplyBy16;
        config.system_clock = SystemController::SystemClockSelect::kPll;
        flash_code          = 0b010;
      }

      SECTION("Pll speed = 72 MHz, using external")
      {
        // Setup
        // Setup: External Oscillator set to 8_Mhz
        config.high_speed_external = 8_MHz;
        config.pll.source   = SystemController::PllSource::kHighSpeedExternal;
        config.pll.enable   = true;
        config.pll.multiply = SystemController::PllMultiply::kMultiplyBy9;
        config.system_clock = SystemController::SystemClockSelect::kPll;
        flash_code          = 0b010;
      }

      // Exercise
      test_subject.Initialize();
      simulate_pll_locks.join();
      simulate_high_oscillator_ready.join();

      // Verify
      CHECK(flash_code == bit::Extract(local_flash.ACR,
                                       sjsu::bit::MaskFromRange(0, 2)));
    }

    SECTION("Changing dividers")
    {
      // Setup
      config.ahb.divider          = SystemController::AHBDivider::kDivideBy512;
      config.ahb.apb1.divider     = SystemController::APBDivider::kDivideBy2;
      config.ahb.apb2.divider     = SystemController::APBDivider::kDivideBy4;
      config.ahb.apb2.adc.divider = SystemController::AdcDivider::kDivideBy6;

      // Exercise
      test_subject.Initialize();
    }

    SECTION("Set System Clock to High Speed External")
    {
      // Setup
      config.system_clock =
          SystemController::SystemClockSelect::kHighSpeedExternal;

      // Exercise
      test_subject.Initialize();
    }

    SECTION("RTC dividers")
    {
      // Setup
      config.rtc.enable = true;
      SECTION("kHighSpeedExternalDividedBy128")
      {
        config.rtc.source =
            SystemController::RtcSource::kHighSpeedExternalDividedBy128;
      }
      SECTION("kLowSpeedExternal")
      {
        config.rtc.source = SystemController::RtcSource::kLowSpeedExternal;
      }
      SECTION("kLowSpeedInternal")
      {
        config.rtc.source = SystemController::RtcSource::kLowSpeedInternal;
      }
      SECTION("kNoClock")
      {
        config.rtc.source = SystemController::RtcSource::kNoClock;
      }

      // Exercise
      test_subject.Initialize();
    }

    simulated_system_clock_ready.join();

    // Verify
    // Verify: Set the RTC oscillator source
    CHECK(Value(config.rtc.source) ==
          bit::Extract(local_rcc.BDCR,
                       SystemController::RtcRegisters::kRtcSourceSelect));

    // Verify: Enable/Disable the RTC
    CHECK(config.rtc.enable ==
          bit::Extract(local_rcc.BDCR,
                       SystemController::RtcRegisters::kRtcEnable));

    // Verify: Set System Clock Source
    CHECK(
        Value(config.system_clock) ==
        bit::Extract(
            local_rcc.CFGR,
            SystemController::ClockConfigurationRegisters::kSystemClockSelect));

    // Verify: Set PLL Source
    // Verify: Need to clear the second bit used to select the high speed
    //         external divide by 2.
    CHECK((Value(config.pll.source) & ~(0b10)) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kPllSource));

    // Verify: Set USB Divider
    CHECK(Value(config.pll.usb.divider) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kUsbPrescalar));

    // Verify: Set AHB divider
    CHECK(Value(config.ahb.divider) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kAHBDivider));

    // Verify: Set APB1 divider
    CHECK(Value(config.ahb.apb1.divider) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kAPB1Divider));

    // Verify: Set APB2 divider
    CHECK(Value(config.ahb.apb2.divider) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kAPB2Divider));

    // Verify: Set ADC divider
    CHECK(Value(config.ahb.apb2.adc.divider) ==
          bit::Extract(
              local_rcc.CFGR,
              SystemController::ClockConfigurationRegisters::kAdcDivider));
  }

  SECTION("GetClockRate()")
  {
    // Setup
    config.high_speed_external = 16_MHz;
    config.low_speed_external  = 32_kHz;

    config.system_clock = SystemController::SystemClockSelect::kPll;

    config.pll.enable   = true;
    config.pll.multiply = SystemController::PllMultiply::kMultiplyBy9;
    config.pll.source =
        SystemController::PllSource::kHighSpeedExternalDividedBy2;

