libhal/SJSU-Dev2/library/L1_Peripheral/stm32f10x/test/system_controller_test.cpp
    // Setup: Set the registers with all of the enable bits so keep looping form
    //        happening.
    local_rcc.CFGR = bit::Insert(
        local_rcc.CFGR, Value(config.system_clock),
        SystemController::ClockConfigurationRegisters::kSystemClockStatus);
    local_rcc.CR = bit::Set(local_rcc.CR,
                            SystemController::ClockControlRegisters::kPllReady);
    local_rcc.CR =
        bit::Set(local_rcc.CR,
                 SystemController::ClockControlRegisters::kExternalOscReady);
    local_rcc.BDCR = bit::Set(
        local_rcc.BDCR, SystemController::RtcRegisters::kLowSpeedOscReady);

    SECTION("AHB Devices")
    {
      // Setup
      std::array<std::tuple<int, SystemController::AHBDivider>, 9> dividers = {
        std::make_tuple(1, SystemController::AHBDivider::kDivideBy1),
        std::make_tuple(2, SystemController::AHBDivider::kDivideBy2),
        std::make_tuple(4, SystemController::AHBDivider::kDivideBy4),
        std::make_tuple(8, SystemController::AHBDivider::kDivideBy8),
        std::make_tuple(16, SystemController::AHBDivider::kDivideBy16),
        std::make_tuple(64, SystemController::AHBDivider::kDivideBy64),
        std::make_tuple(128, SystemController::AHBDivider::kDivideBy128),
        std::make_tuple(256, SystemController::AHBDivider::kDivideBy256),
        std::make_tuple(512, SystemController::AHBDivider::kDivideBy512),
      };

      for (size_t i = 0; i < dividers.size(); i++)
      {
        // Setup
        INFO("Failure on index [" << i
                                  << "] divider: " << std::get<0>(dividers[i]));
        auto ahb_frequency = 72_MHz / std::get<0>(dividers[i]);
        config.ahb.divider = std::get<1>(dividers[i]);

        // Exercise
        test_subject.Initialize();

        // Exercise + Verify
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kDma1));
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kDma2));
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kSram));
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kCrc));
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kFsmc));
        CHECK(ahb_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kSdio));
      }
    }

    SECTION("APB1 Devices")
    {
      // Setup
      config.ahb.divider = SystemController::AHBDivider::kDivideBy1;

      std::array<std::tuple<int, SystemController::APBDivider>, 5> dividers = {
        std::make_tuple(1, SystemController::APBDivider::kDivideBy1),
        std::make_tuple(2, SystemController::APBDivider::kDivideBy2),
        std::make_tuple(4, SystemController::APBDivider::kDivideBy4),
        std::make_tuple(8, SystemController::APBDivider::kDivideBy8),
        std::make_tuple(16, SystemController::APBDivider::kDivideBy16),
      };

      for (size_t i = 0; i < dividers.size(); i++)
      {
        // Setup
        INFO("Failure on index [" << i
                                  << "] divider: " << std::get<0>(dividers[i]));
        auto expected_frequency = 72_MHz / std::get<0>(dividers[i]);
        config.ahb.apb1.divider = std::get<1>(dividers[i]);

        // Exercise
        test_subject.Initialize();

        // Exercise + Verify
        int timer_frequency_doubler = (i == 0) ? 1 : 2;

        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer2));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer3));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer4));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer5));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer6));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer7));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer12));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer13));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer14));

        CHECK(expected_frequency ==
              test_subject.GetClockRate(
                  SystemController::Peripherals::kWindowWatchdog));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kSpi2));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kSpi3));
        CHECK(
            expected_frequency ==
            test_subject.GetClockRate(SystemController::Peripherals::kUsart2));
        CHECK(
            expected_frequency ==
            test_subject.GetClockRate(SystemController::Peripherals::kUsart3));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kUart4));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kUart5));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kI2c1));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kI2c2));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kCan1));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(
                  SystemController::Peripherals::kBackupClock));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kPower));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kDac));
      }
    }

    SECTION("APB2 Devices")
    {
      // Setup
      config.ahb.divider = SystemController::AHBDivider::kDivideBy1;

      std::array<std::tuple<int, SystemController::APBDivider>, 5> dividers = {
        std::make_tuple(1, SystemController::APBDivider::kDivideBy1),
        std::make_tuple(2, SystemController::APBDivider::kDivideBy2),
        std::make_tuple(4, SystemController::APBDivider::kDivideBy4),
        std::make_tuple(8, SystemController::APBDivider::kDivideBy8),
        std::make_tuple(16, SystemController::APBDivider::kDivideBy16),
      };

      for (size_t i = 0; i < dividers.size(); i++)
      {
        // Setup
        INFO("Failure on index [" << i
                                  << "] divider: " << std::get<0>(dividers[i]));
        units::frequency::hertz_t expected_frequency =
            72_MHz / std::get<0>(dividers[i]);
        config.ahb.apb2.divider = std::get<1>(dividers[i]);

