libhal/SJSU-Dev2/library/L1_Peripheral/stm32f10x/test/system_controller_test.cpp
        // Exercise
        test_subject.Initialize();

        // Exercise + Verify
        int timer_frequency_doubler = (i == 0) ? 1 : 2;

        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kAFIO));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioA));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioB));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioC));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioD));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioE));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioF));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kGpioG));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer1));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kSpi1));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer8));
        CHECK(
            expected_frequency ==
            test_subject.GetClockRate(SystemController::Peripherals::kUsart1));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer9));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer10));
        CHECK(
            expected_frequency * timer_frequency_doubler ==
            test_subject.GetClockRate(SystemController::Peripherals::kTimer11));
      }
    }

    SECTION("ADC Devices")
    {
      // Setup
      config.ahb.divider      = SystemController::AHBDivider::kDivideBy1;
      config.ahb.apb2.divider = SystemController::APBDivider::kDivideBy1;

      std::array<std::tuple<int, SystemController::AdcDivider>, 4> dividers = {
        std::make_tuple(2, SystemController::AdcDivider::kDivideBy2),
        std::make_tuple(4, SystemController::AdcDivider::kDivideBy4),
        std::make_tuple(6, SystemController::AdcDivider::kDivideBy6),
        std::make_tuple(8, SystemController::AdcDivider::kDivideBy8),
      };

      for (size_t i = 0; i < dividers.size(); i++)
      {
        // Setup
        INFO("Failure on index [" << i
                                  << "] divider: " << std::get<0>(dividers[i]));
        units::frequency::hertz_t expected_frequency =
            72_MHz / std::get<0>(dividers[i]);
        config.ahb.apb2.adc.divider = std::get<1>(dividers[i]);

        // Exercise
        test_subject.Initialize();

        // Exercise + Verify
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kAdc1));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kAdc2));
        CHECK(expected_frequency ==
              test_subject.GetClockRate(SystemController::Peripherals::kAdc3));
      }
    }

    SECTION("USB Clock Rate")
    {
      config.ahb.divider      = SystemController::AHBDivider::kDivideBy1;
      config.ahb.apb2.divider = SystemController::APBDivider::kDivideBy1;

      SECTION("Divide by 1")
      {
        // Setup
        config.pll.usb.divider = SystemController::UsbDivider::kDivideBy1;

        // Exercise
        test_subject.Initialize();

        // Verify
        CHECK(72_MHz ==
              test_subject.GetClockRate(SystemController::Peripherals::kUsb));
      }

      SECTION("Divide by 1.5")
      {
        // Setup
        config.pll.usb.divider = SystemController::UsbDivider::kDivideBy1Point5;

        // Exercise
        test_subject.Initialize();

        // Verify
        CHECK(48_MHz ==
              test_subject.GetClockRate(SystemController::Peripherals::kUsb));
      }
    }

    SECTION("CPU Clock Rate")
    {
      // Setup
      config.ahb.divider      = SystemController::AHBDivider::kDivideBy1;
      config.ahb.apb2.divider = SystemController::APBDivider::kDivideBy1;

      // Exercise
      test_subject.Initialize();

      // Verify
      CHECK(72_MHz ==
            test_subject.GetClockRate(SystemController::Peripherals::kCpu));
      CHECK(72_MHz == test_subject.GetClockRate(
                          SystemController::Peripherals::kSystemTimer));
    }

    SECTION("FLINTF Clock Rate")
    {
      // Setup
      config.ahb.divider      = SystemController::AHBDivider::kDivideBy1;
      config.ahb.apb2.divider = SystemController::APBDivider::kDivideBy1;

      // Exercise
      test_subject.Initialize();

      // Verify
      CHECK(SystemController::kHighSpeedInternal ==
            test_subject.GetClockRate(SystemController::Peripherals::kFlitf));
    }

    SECTION("I2S Clock Rate")
    {
      // Setup
      // Make sure that I2S is not following the AHB divider
      config.ahb.divider = SystemController::AHBDivider::kDivideBy512;

      // Exercise
      test_subject.Initialize();

      // Verify
      CHECK(72_MHz ==
            test_subject.GetClockRate(SystemController::Peripherals::kI2s));
    }

    SECTION("Invalid Peripheral")
    {
      // Exercise
      test_subject.Initialize();

      // Verify
      CHECK(0_Hz == test_subject.GetClockRate(
                        SystemController::PeripheralID::Define<0xFFFF>()));
    }
  }

  stm32f10x::SystemController::enable[0]     = &RCC->AHBENR;
  stm32f10x::SystemController::enable[1]     = &RCC->APB1ENR;
  stm32f10x::SystemController::enable[2]     = &RCC->APB2ENR;
  stm32f10x::SystemController::clock_control = RCC;
  stm32f10x::SystemController::flash         = FLASH;
}
}  // namespace sjsu::stm32f10x
